РазработкаОУМобильная/src/Catalogs/СК_ПродукцияОЦМ/СК_ПродукцияОЦМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_ПродукцияОЦМ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.СК_ГруппыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаСплава</name>
    <type>
      <types>CatalogRef.СК_МаркиСплавов</types>
    </type>
  </attributes>
  <attributes>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.СК_НДНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйНД</name>
    <type>
      <types>CatalogRef.СК_НДНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>НДНаХимСостав</name>
    <type>
      <types>CatalogRef.СК_НДНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловноеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодИзготовления</name>
    <type>
      <types>CatalogRef.СК_МетодыИзготовления</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСечения</name>
    <type>
      <types>CatalogRef.СК_ФормыСечения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьИзготовления</name>
    <type>
      <types>CatalogRef.СК_ТочностьИзготовления</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СК_Состояния</types>
    </type>
  </attributes>
  <attributes>
    <name>Мерность</name>
    <type>
      <types>CatalogRef.СК_Мерность</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловия</name>
    <type>
      <types>CatalogRef.СК_ОсобыеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Металлопрокат</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодгруппаТрудоемкости</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъединениеПоТехЦепочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъединениеПоПрокату</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРазмера</name>
    <type>
      <types>CatalogRef.СК_ТипыРазмеров</types>
    </type>
  </attributes>
</mdclass:Catalog>

РазработкаОУМобильная/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
</mdclass:Enum>

РазработкаОУМобильная/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>(Общ) Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>(Общ) Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>(Общ) Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
</mdclass:Enum>

РазработкаОУМобильная/src/Enums/ВидыВоспроизводстваНоменклатуры/ВидыВоспроизводстваНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВоспроизводстваНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Переработка</name>
  </enumValues>
  <enumValues>
    <name>ПринятыеВПереработку</name>
  </enumValues>
</mdclass:Enum>

РазработкаОУМобильная/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиОперативныйУчетОстатковНЗП</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПартионныйУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериямВНЗП</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВоспроизводства</name>
    <comment>(Упр)</comment>
    <type>
      <types>EnumRef.ВидыВоспроизводстваНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Набор</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеИспользования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджерЗаПокупки</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнешняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнутренняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВыпуска</name>
    <type>
      <types>EnumRef.НаправленияВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеСписанияВыпущеннойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПрисвоенияСерийногоНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКП</name>
    <comment>Общероссийский классификатор продукции</comment>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияМест</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураОЦМ_ск</name>
    <type>
      <types>CatalogRef.СК_ПродукцияОЦМ</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ФормулаРасчетаКоличестваМест</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ФормулаРасчетаКоличества</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_НЕОтображатьВСписке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ГруппаПланирование</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ПровереноЭкспертом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатурыВФорматеHTML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ВестиУчетПоХарактеристикамРАУЗ</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ВестиУчетПоХарактеристикамРАУЗВНЗП</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УГМК_ВестиУчетПоСериямРАУЗ</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <comment>(Общ)</comment>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НоменклатурныеГруппы</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждатьОНецелыхМестах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ДополнительныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_Засор</name>
    <comment>Единица измерения для засора</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/СК_ПродукцияОЦМ/ObjectModule.bsl
Перем мЭтоНовый,мНовыйЭлементМетал;

Процедура СоздатьНовыйЭлементМеталлопрокат(Отказ)
	
	Если ЭтоГруппа Тогда
				
		мНовыйЭлементМетал = Справочники.Номенклатура.СоздатьГруппу();
				
	Иначе
				
		мНовыйЭлементМетал = Справочники.Номенклатура.СоздатьЭлемент();
				
	КонецЕсли;
	
	СинхронизироватьДанные(мНовыйЭлементМетал);
	
	Если Не ЭтоГруппа Тогда
		
		мНовыйЭлементМетал.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("кг",Истина);
		мНовыйЭлементМетал.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту("ТипНоменклатуры",Перечисления.ТипыНоменклатуры.Товар);
		мНовыйЭлементМетал.ВестиУчетПоХарактеристикам = Истина;
		мНовыйЭлементМетал.ВестиУчетПоСериям = Истина;
		мНовыйЭлементМетал.ВестиПартионныйУчетПоСериям = Истина;
		мНовыйЭлементМетал.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		//устанавливаем вид воспроизводства, чтобы использовать планирование
		мНовыйЭлементМетал.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство;	
		
	КонецЕсли;	
	
	Попытка
		мНовыйЭлементМетал.Записать();
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	//Если ЭтоГруппа И мНовыйЭлементМетал.Уровень() = 3 Тогда
	//		Сообщить("Номенклатура Код: " + мНовыйЭлементМетал.Код+" Наименование: "+мНовыйЭлементМетал.Наименование);
	//КонецЕсли;	
	
	Металлопрокат = мНовыйЭлементМетал.Ссылка;
	
	Если Не ЭтоГруппа Тогда
		СоздатьЕдиницуИзмерения(мНовыйЭлементМетал);
	КонецЕсли;	
	
КонецПроцедуры

Процедура СоздатьЕдиницуИзмерения(мНовыйЭлементМетал)
	//СоздатьБазовую Единицу Измерения
	ЕдиницаОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	ЕдиницаОбъект.Наименование            = мНовыйЭлементМетал.БазоваяЕдиницаИзмерения.Наименование;
	ЕдиницаОбъект.ЕдиницаПоКлассификатору = мНовыйЭлементМетал.БазоваяЕдиницаИзмерения;
	ЕдиницаОбъект.Коэффициент             = 1;
	
	ЕдиницаОбъект.Владелец                = мНовыйЭлементМетал.Ссылка;
	ЕдиницаОбъект.Записать();
	
	мНовыйЭлементМетал.ЕдиницаДляОтчетов =  ЕдиницаОбъект.Ссылка;
	мНовыйЭлементМетал.ЕдиницаХраненияОстатков =  ЕдиницаОбъект.Ссылка;
//ДОбавлено	20080129
	//Создать вторую Единицу Измерения
	ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("т",Истина);
	Если НЕ ЕдиницаПоКлассификатору.Пустая() Тогда
		ЕдиницаОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		ЕдиницаОбъект.Наименование            = ЕдиницаПоКлассификатору.Наименование;
		ЕдиницаОбъект.ЕдиницаПоКлассификатору = ЕдиницаПоКлассификатору;
		ЕдиницаОбъект.Коэффициент             = 1000;
		ЕдиницаОбъект.Владелец                = мНовыйЭлементМетал.Ссылка;
		ЕдиницаОбъект.Записать();
	КонецЕсли;
//ДОбавлено	20080129
	
КонецПроцедуры

Процедура РедактироватьЭлементМеталлопрокат(Отказ)
	
	Если НЕ Металлопрокат = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Элемент = Металлопрокат.ПолучитьОбъект();
		СинхронизироватьДанные(Элемент);	
		Элемент.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура СинхронизироватьДанные(Элемент)
	
	Элемент.Наименование =  Наименование;
	Элемент.ПометкаУдаления =  ПометкаУдаления;
	
	Если Не ЭтоГруппа Тогда

		Элемент.НаименованиеПолное =  Наименование;
		//устанавливаем вид воспроизводства, чтобы использовать планирование
		Элемент.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство;	

	КонецЕсли;	
	
	//ГруппаМеталлопрокат = Справочники.Номенклатура.НайтиПоНаименованию("Металлопрокат", Истина);	
	ГруппаМеталлопрокат = Справочники.Номенклатура.НайтиПоНаименованию("МеталлопродукцияОЦМ", Истина);	
	
	Если  ГруппаМеталлопрокат.Пустая() Тогда
		
		НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
		НоваяГруппа.Наименование = "МеталлопродукцияОЦМ";
		
		НоваяГруппа.Записать();
		ГруппаМеталлопрокат = НоваяГруппа.Ссылка;
	КонецЕсли;	
	 
	Если  Родитель.Металлопрокат.Пустая() Тогда 
		
		Элемент.Родитель = ГруппаМеталлопрокат;
		
	Иначе	
		
		Элемент.Родитель = Родитель.Металлопрокат;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	мЭтоНовый	= ЭтоНовый();

	//Если Не Отказ И Не ОбменДанными.Загрузка Тогда
	//	
	//	Если ЭтоНовый() Тогда
	//		
	//		СоздатьНовыйЭлементМеталлопрокат(Отказ);
	//		
	//	Иначе
	//		
	//		РедактироватьЭлементМеталлопрокат(Отказ);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры	

Процедура ПриЗаписи(Отказ)
	
	//Если Не Отказ И Не ОбменДанными.Загрузка Тогда
	//	
	//	Если мЭтоНовый Тогда
	//		
	//		мНовыйЭлементМетал.НоменклатураОЦМ_ск = Ссылка;
	//		мНовыйЭлементМетал.ОбменДанными.Загрузка = Истина;
	//		мНовыйЭлементМетал.Записать();
	//		
	//	КонецЕсли;
	//	
	//	//Если Не ЭтоГруппа Тогда
	//	//	ЗаписатьЗначенияСвойств(ПрочитатьЗаполнитьСвойстваИЗначения());
	//	//КонецЕсли;	
	//	
	//КонецЕсли;
	
КонецПроцедуры	

Процедура ПередУдалением(Отказ)
	
	
	
КонецПроцедуры
